
// Size: 0xB4C, DWARF: 0x73CED2
struct Bridge_s
{
    struct NuVec pos[24][2]; // Offset: 0x0, DWARF: 0x73CEE4
    struct NuVec vel[24][2]; // Offset: 0x240, DWARF: 0x73CF0C
    struct numtx_s mtx[24]; // Offset: 0x480, DWARF: 0x73CF34
    struct nuinstance_s* instance[24]; // Offset: 0xA80, DWARF: 0x73CF5C
    struct nuinstance_s* ipost; // Offset: 0xAE0, DWARF: 0x73CF89
    struct NuVec center; // Offset: 0xAE4, DWARF: 0x73CFB6
    float radius; // Offset: 0xAF0, DWARF: 0x73CFE1
    short plat[24]; // Offset: 0xAF4, DWARF: 0x73D00A
    char inrange; // Offset: 0xB24, DWARF: 0x73D033
    char onscreen; // Offset: 0xB25, DWARF: 0x73D05D
    char sections; // Offset: 0xB26, DWARF: 0x73D088
    char postint; // Offset: 0xB27, DWARF: 0x73D0B3
    s32 colour; // Offset: 0xB28, DWARF: 0x73D0DD
    short hit; // Offset: 0xB2C, DWARF: 0x73D106
    short yang; // Offset: 0xB2E, DWARF: 0x73D12C
    float width; // Offset: 0xB30, DWARF: 0x73D153
    float tension; // Offset: 0xB34, DWARF: 0x73D17B
    float gravity; // Offset: 0xB38, DWARF: 0x73D1A5
    float damp; // Offset: 0xB3C, DWARF: 0x73D1CF
    float plrweight; // Offset: 0xB40, DWARF: 0x73D1F6
    float postw; // Offset: 0xB44, DWARF: 0x73D222
    float posth; // Offset: 0xB48, DWARF: 0x73D24A
};

struct nugscn_s* NuBridge_base_scene;
#define SQR(x) ((x)*(x))


//NGC MATCH
struct Bridge_s* NuBridgeAlloc(void) {
  if (BridgeFree < 8) {
      return &Bridges[BridgeFree++];
  }
  return NULL;
}

//NGC MATCH
void NuBridgeRegisterBaseScene(struct nugscn_s *scn) {
  NuBridge_base_scene = scn;
  return;
}

//NGC MATCH
s32 NuBridgeLookupInstanceIndex(struct nuinstance_s *instance) {
  s32 i;
  
  if (NuBridge_base_scene == NULL) {
    return -1;
  }
  for(i = 0; i < NuBridge_base_scene->numinstance; i++) {
      if (&NuBridge_base_scene->instances[i] == instance) {
        return i;
      }
  }
  return -1;
}

//NGC MATCH
void NuBridgeInit(void) {
    BridgeFree = 0;
}

//NGC MATCH
s32* NuBridgeCreate(struct nuinstance_s** instance,struct nuinstance_s* ipost,struct nuvec_s* start,struct nuvec_s* end,float width,
    short yang,float tension,float damp,float gravity,float plrweight,s32 sections,float postw,float posth,s32 postint,s32 colour) {
 
    struct nuvec_s dir; // 0x8(r1)
    struct nuvec_s dir90; // 0x18(r1)
    struct Bridge_s* bridge;
    s32 lp;
    float t;

    if (sections > 24) {
        printf("to many sections/n");
    }
    NuBridgeOn(1);
    bridge = NuBridgeAlloc();
    if (bridge != NULL) {
        bridge->tension = tension;
        bridge->damp = damp;
        bridge->gravity = gravity;
        bridge->ipost = ipost;
        bridge->plrweight = plrweight;
        bridge->postw = postw;
        bridge->posth = posth;
        bridge->postint = postint;
        bridge->colour = colour;
        bridge->sections = sections;
        bridge->width = width;
        
        (bridge->center).x = (end->x + start->x) * 0.5f;
        (bridge->center).y = (end->y + start->y) * 0.5f;
        (bridge->center).z = (end->z + start->z) * 0.5f;
        
        dir.x = end->x - start->x;
        dir.y = end->y - start->y;
        dir.z = end->z - start->z;

        bridge->radius = SQR(dir.x * 0.5f) + SQR(dir.y * 0.5f) + SQR(dir.z * 0.5f) + 1.0f;
