typedef struct {
    // total size: 0xB4C
    struct nuvec_s pos[24][2]; // offset 0x0, size 0x240
    struct nuvec_s vel[24][2]; // offset 0x240, size 0x240
    struct numtx_s mtx[24]; // offset 0x480, size 0x600
    struct nuinstance_s * instance[24]; // offset 0xA80, size 0x60
    struct nuinstance_s * ipost; // offset 0xAE0, size 0x4
    struct nuvec_s center; // offset 0xAE4, size 0xC
    float radius; // offset 0xAF0, size 0x4
    short plat[24]; // offset 0xAF4, size 0x30
    char inrange; // offset 0xB24, size 0x1
    char onscreen; // offset 0xB25, size 0x1
    char sections; // offset 0xB26, size 0x1
    char postint; // offset 0xB27, size 0x1
    int colour; // offset 0xB28, size 0x4
    short hit; // offset 0xB2C, size 0x2
    short yang; // offset 0xB2E, size 0x2
    float width; // offset 0xB30, size 0x4
    float tension; // offset 0xB34, size 0x4
    float gravity; // offset 0xB38, size 0x4
    float damp; // offset 0xB3C, size 0x4
    float plrweight; // offset 0xB40, size 0x4
    float postw; // offset 0xB44, size 0x4
    float posth; // offset 0xB48, size 0x4
} BridgeType;

BridgeType Bridges[8];
s32 BridgeFree;
s32 NuBridgeProc;

struct nugscn_s* NuBridge_base_scene;
#define SQR(x) ((x)*(x))


//NGC MATCH
BridgeType* NuBridgeAlloc(void) {
  if (BridgeFree < 8) {
      return &Bridges[BridgeFree++];
  }
  return NULL;
}

//NGC MATCH
void NuBridgeRegisterBaseScene(struct nugscn_s *scn) {
  NuBridge_base_scene = scn;
  return;
}

//NGC MATCH
s32 NuBridgeLookupInstanceIndex(struct nuinstance_s *instance) {
  s32 i;
  
  if (NuBridge_base_scene == NULL) {
    return -1;
  }
  for(i = 0; i < NuBridge_base_scene->numinstance; i++) {
      if (&NuBridge_base_scene->instances[i] == instance) {
        return i;
      }
  }
  return -1;
}

//NGC MATCH
void NuBridgeInit(void) {
    BridgeFree = 0;
}

//NGC MATCH
s32* NuBridgeCreate(struct nuinstance_s** instance,struct nuinstance_s* ipost,struct nuvec_s* start,struct nuvec_s* end,float width,
    short yang,float tension,float damp,float gravity,float plrweight,s32 sections,float postw,float posth,s32 postint,s32 colour) {
 
    struct nuvec_s dir; // 0x8(r1)
    struct nuvec_s dir90; // 0x18(r1)
    BridgeType* bridge;
    s32 lp;
    float t;

    if (sections > 24) {
        printf("to many sections/n");
    }
    NuBridgeOn(1);
    bridge = NuBridgeAlloc();
    if (bridge != NULL) {
        bridge->tension = tension;
        bridge->damp = damp;
        bridge->gravity = gravity;
        bridge->ipost = ipost;
        bridge->plrweight = plrweight;
        bridge->postw = postw;
        bridge->posth = posth;
        bridge->postint = postint;
        bridge->colour = colour;
        bridge->sections = sections;
        bridge->width = width;
        
        (bridge->center).x = (end->x + start->x) * 0.5f;
        (bridge->center).y = (end->y + start->y) * 0.5f;
        (bridge->center).z = (end->z + start->z) * 0.5f;
        
        dir.x = end->x - start->x;
        dir.y = end->y - start->y;
        dir.z = end->z - start->z;

        bridge->radius = SQR(dir.x * 0.5f) + SQR(dir.y * 0.5f) + SQR(dir.z * 0.5f) + 1.0f;
